#include<stdio.h>
#include<stdlib.h>
#include<Windows.h>
#define N 5  //主词条种类
#define O 7  //副词条位置
#define P 10  //副词条种类

/*
    生之花：1

　　生命值。

　　死之羽：3

　　攻击力。

　　时之沙：2 4 6 9 10 

　　攻击力百分比、防御力百分比、生命值百分比、元素精通、元素充能效率。

　　空之杯：2 4 6 9 12

　　攻击力百分比、防御力百分比、生命值百分比、元素精通、物理伤害加成、某元素伤害加成。

　　理之冠：2 4 6 7 8 9 11

　　攻击力百分比、防御力百分比、生命值百分比、元素精通、暴击率、暴击伤害、治疗加成。

　　圣遗物副属性词条类型：

　　攻击力、攻击力百分比、防御力、防御力百分比、生命值、生命值百分比、暴击率、暴击伤害、元素精通、元素充能效率。
  */

//生命值、生命值百分比、攻击力、攻击力百分比、防御力、防御力百分比、暴击率、暴击伤害、元素精通、元素充能效率、治疗加成、伤害加成
//   1        2            3        4            5           6         7        8         9           10          11       12
int main()
{
	int i, j, k;
	float a[N][O][P], b[N][O][P], c[N][O][P], d[N][O][P], e[N][O][P];//词条位置
	

	for (;;) {
		for (i=1,j=1,k=1;;) {//生之花
			if (i == k)k++;
			a[i][j][k]++;

		}
	}
	

	


	printf("a=%f",a[i][i][i]);
	system("pause");
}